Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_rmu.h
#define    RMU_RSTFR_MDF_FLAG_Pos                                 (12U)
#define    RMU_RSTFR_MDF_FLAG_Msk                                 (0x1U << RMU_RSTFR_MDF_FLAG_Pos)
#define    RMU_RSTFR_MDF_FLAG                                     RMU_RSTFR_MDF_FLAG_Msk

#define    RMU_RSTFR_NRST_FLAG_Pos                                (11U)
#define    RMU_RSTFR_NRST_FLAG_Msk                                (0x1U << RMU_RSTFR_NRST_FLAG_Pos)
#define    RMU_RSTFR_NRST_FLAG                                    RMU_RSTFR_NRST_FLAG_Msk

#define    RMU_RSTFR_PODR_FLAG_Pos                                (8U)
#define    RMU_RSTFR_PODR_FLAG_Msk                                (0x1U << RMU_RSTFR_PODR_FLAG_Pos)
#define    RMU_RSTFR_PODR_FLAG                                    RMU_RSTFR_PODR_FLAG_Msk

#define    RMU_RSTFR_LOL_FLAG_Pos                                 (7U)
#define    RMU_RSTFR_LOL_FLAG_Msk                                 (0x1U << RMU_RSTFR_LOL_FLAG_Pos)
#define    RMU_RSTFR_LOL_FLAG                                     RMU_RSTFR_LOL_FLAG_Msk

#define    RMU_RSTFR_LOC_FLAG_Pos                                 (6U)
#define    RMU_RSTFR_LOC_FLAG_Msk                                 (0x1U << RMU_RSTFR_LOC_FLAG_Pos)
#define    RMU_RSTFR_LOC_FLAG                                     RMU_RSTFR_LOC_FLAG_Msk

#define    RMU_RSTFR_SOFT_FLAG_Pos                                (5U)
#define    RMU_RSTFR_SOFT_FLAG_Msk                                (0x1U << RMU_RSTFR_SOFT_FLAG_Pos)
#define    RMU_RSTFR_SOFT_FLAG                                    RMU_RSTFR_SOFT_FLAG_Msk

#define    RMU_RSTFR_IWDT_FLAG_Pos                                (4U)
#define    RMU_RSTFR_IWDT_FLAG_Msk                                (0x1U << RMU_RSTFR_IWDT_FLAG_Pos)
#define    RMU_RSTFR_IWDT_FLAG                                    RMU_RSTFR_IWDT_FLAG_Msk

#define    RMU_RSTFR_SVD_FLAG_Pos                                 (3U)
#define    RMU_RSTFR_SVD_FLAG_Msk                                 (0x1U << RMU_RSTFR_SVD_FLAG_Pos)
#define    RMU_RSTFR_SVD_FLAG                                     RMU_RSTFR_SVD_FLAG_Msk

#define    RMU_RSTFR_WWDT_FLAG_Pos                                (2U)
#define    RMU_RSTFR_WWDT_FLAG_Msk                                (0x1U << RMU_RSTFR_WWDT_FLAG_Pos)
#define    RMU_RSTFR_WWDT_FLAG                                    RMU_RSTFR_WWDT_FLAG_Msk

#define    RMU_RSTFR_LKUP_FLAG_Pos                                (1U)
#define    RMU_RSTFR_LKUP_FLAG_Msk                                (0x1U << RMU_RSTFR_LKUP_FLAG_Pos)
#define    RMU_RSTFR_LKUP_FLAG                                    RMU_RSTFR_LKUP_FLAG_Msk

#define    RMU_RSTFR_NVIC_FLAG_Pos                                (0U)
#define    RMU_RSTFR_NVIC_FLAG_Msk                                (0x1U << RMU_RSTFR_NVIC_FLAG_Pos)
#define    RMU_RSTFR_NVIC_FLAG                                    RMU_RSTFR_NVIC_FLAG_Msk

#define    PERHRSTEN_KEY                                          (0x13579BDFUL)
#define    SOFTWARERESET_KEY                                      (0x5C5CAABBUL)

#define    FL_RMU_RSTAHB_QSPI                                     (0x0U << 0U)
#define    FL_RMU_RSTAHB_DMA                                      (0x1U << 0U)
#define    FL_RMU_RSTAPB_UART5                                    (0x1fU << 0U)
#define    FL_RMU_RSTAPB_UART4                                    (0x1eU << 0U)
#define    FL_RMU_RSTAPB_UART3                                    (0x1dU << 0U)
#define    FL_RMU_RSTAPB_UART2                                    (0x1cU << 0U)
#define    FL_RMU_RSTAPB_UART1                                    (0x1bU << 0U)
#define    FL_RMU_RSTAPB_UART0                                    (0x1aU << 0U)
#define    FL_RMU_RSTAPB_UARTIR                                   (0x19U << 0U)
#define    FL_RMU_RSTAPB_INTMUX                                   (0x17U << 0U)
#define    FL_RMU_RSTAPB_UART7                                    (0x11U << 0U)
#define    FL_RMU_RSTAPB_UART6                                    (0x10U << 0U)
#define    FL_RMU_RSTAPB_SPI2                                     (0xfU << 0U)
#define    FL_RMU_RSTAPB_SPI1                                     (0xeU << 0U)
#define    FL_RMU_RSTAPB_SPI0                                     (0xdU << 0U)
#define    FL_RMU_RSTAPB_I2C1                                     (0xcU << 0U)
#define    FL_RMU_RSTAPB_I2C0                                     (0xbU << 0U)
#define    FL_RMU_RSTAPB_LPUART                                   (0x8U << 0U)
#define    FL_RMU_RSTAPB_TSI                                      (0x5U << 0U)
#define    FL_RMU_RSTAPB_ATIM                                     (0x4U << 0U)
#define    FL_RMU_RSTAPB_TAU1                                     (0x3U << 0U)
#define    FL_RMU_RSTAPB_TAU0                                     (0x2U << 0U)
#define    FL_RMU_RSTAPB_LPTIM16                                  (0x1U << 0U)
#define    FL_RMU_RSTAPB_BSTIM16                                  (0x0U << 0U)
#define    FL_RMU_RSTAPB_DAC                                      (0x39U << 0U)
#define    FL_RMU_RSTAPB_ADCC                                     (0x38U << 0U)
#define    FL_RMU_RSTAPB_ADC                                      (0x37U << 0U)
#define    FL_RMU_RSTAPB_CLM2                                     (0x36U << 0U)
#define    FL_RMU_RSTAPB_CLM1                                     (0x35U << 0U)
#define    FL_RMU_RSTAPB_CLM0                                     (0x34U << 0U)
#define    FL_RMU_RSTAPB_CRC                                      (0x31U << 0U)
#define    FL_RMU_RSTAPB_SENT1                                    (0x2bU << 0U)
#define    FL_RMU_RSTAPB_SENT0                                    (0x2aU << 0U)
#define    FL_RMU_RSTAPB_FDCANR                                   (0x27U << 0U)
#define    FL_RMU_RSTAPB_FDCANP                                   (0x26U << 0U)
#define    FL_RMU_RSTAPB_FDCANC                                   (0x25U << 0U)
#define    FL_RMU_RSTAPB_SVD                                      (0x21U << 0U)
#define    FL_RMU_RSTAPB_COMP                                     (0x20U << 0U)



#define    FL_RMU_PDR_THRESHOLD_1P40V                             (0x0U << RMU_PDRCR_CFG_Pos)
#define    FL_RMU_PDR_THRESHOLD_1P45V                             (0x1U << RMU_PDRCR_CFG_Pos)
#define    FL_RMU_PDR_THRESHOLD_1P50V                             (0x2U << RMU_PDRCR_CFG_Pos)
#define    FL_RMU_PDR_THRESHOLD_1P55V                             (0x3U << RMU_PDRCR_CFG_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup RMU_FL_Exported_Functions RMU Exported Functions
  * @{
  */

/**
  * @brief    Set Power Down Reset Voltage
  * @rmtoll   PDRCR    CFG    FL_RMU_PDR_SetThreshold
  * @param    RMUx RMU instance
  * @param    threshold This parameter can be one of the following values:
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P40V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P45V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P50V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P55V
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_PDR_SetThreshold(RMU_Type* RMUx, uint32_t threshold)
{
    MODIFY_REG(RMUx->PDRCR, RMU_PDRCR_CFG_Msk, threshold);
}

/**
  * @brief    Get Power Down Reset Voltage Setting
  * @rmtoll   PDRCR    CFG    FL_RMU_PDR_GetThreshold
  * @param    RMUx RMU instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P40V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P45V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P50V
  *           @arg @ref FL_RMU_PDR_THRESHOLD_1P55V
  */
__STATIC_INLINE uint32_t FL_RMU_PDR_GetThreshold(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->PDRCR, RMU_PDRCR_CFG_Msk));
}

/**
  * @brief    Get Power Down Reset Enable Status
  * @rmtoll   PDRCR    EN    FL_RMU_PDR_IsEnabled
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_PDR_IsEnabled(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->PDRCR, RMU_PDRCR_EN_Msk) == RMU_PDRCR_EN_Msk);
}

/**
  * @brief    Disable Power Down Reset
  * @rmtoll   PDRCR    EN    FL_RMU_PDR_Disable
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_PDR_Disable(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->PDRCR, RMU_PDRCR_EN_Msk);
}

/**
  * @brief    Enable Power Down Reset
  * @rmtoll   PDRCR    EN    FL_RMU_PDR_Enable
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_PDR_Enable(RMU_Type* RMUx)
{
    SET_BIT(RMUx->PDRCR, RMU_PDRCR_EN_Msk);
}

/**
  * @brief    Get PLL Lost Lock Reset Enable Status
  * @rmtoll   RSTCR    LOLRST_EN    FL_RMU_IsEnabledPLLLostLockReset
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsEnabledPLLLostLockReset(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTCR, RMU_RSTCR_LOLRST_EN_Msk) == RMU_RSTCR_LOLRST_EN_Msk);
}

/**
  * @brief    Disable  PLL Lost Lock  Reset 
  * @rmtoll   RSTCR    LOLRST_EN    FL_RMU_DisablePLLLostLockReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_DisablePLLLostLockReset(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->RSTCR, RMU_RSTCR_LOLRST_EN_Msk);
}

/**
  * @brief    Enable PLL Lost Lock  Reset
  * @rmtoll   RSTCR    LOLRST_EN    FL_RMU_EnablePLLLostLockReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_EnablePLLLostLockReset(RMU_Type* RMUx)
{
    SET_BIT(RMUx->RSTCR, RMU_RSTCR_LOLRST_EN_Msk);
}

/**
  * @brief    Get XTHF Stop Reset Enable Status
  * @rmtoll   RSTCR    LOCRST_EN    FL_RMU_IsEnabledXTHFStopReset
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsEnabledXTHFStopReset(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTCR, RMU_RSTCR_LOCRST_EN_Msk) == RMU_RSTCR_LOCRST_EN_Msk);
}

/**
  * @brief    Disable XTHF Stop Reset 
  * @rmtoll   RSTCR    LOCRST_EN    FL_RMU_DisableXTHFStopReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_DisableXTHFStopReset(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->RSTCR, RMU_RSTCR_LOCRST_EN_Msk);
}

/**
  * @brief    Enable XTHF Stop Reset
  * @rmtoll   RSTCR    LOCRST_EN    FL_RMU_EnableXTHFStopReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_EnableXTHFStopReset(RMU_Type* RMUx)
{
    SET_BIT(RMUx->RSTCR, RMU_RSTCR_LOCRST_EN_Msk);
}

/**
  * @brief    Get LockUp Reset Enable Status
  * @rmtoll   RSTCR    LKUPRST_EN    FL_RMU_IsEnabledLockUpReset
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsEnabledLockUpReset(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTCR, RMU_RSTCR_LKUPRST_EN_Msk) == RMU_RSTCR_LKUPRST_EN_Msk);
}

/**
  * @brief    Disable LockUp Reset 
  * @rmtoll   RSTCR    LKUPRST_EN    FL_RMU_DisableLockUpReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_DisableLockUpReset(RMU_Type* RMUx)
{
    CLEAR_BIT(RMUx->RSTCR, RMU_RSTCR_LKUPRST_EN_Msk);
}

/**
  * @brief    Enable LockUp Reset
  * @rmtoll   RSTCR    LKUPRST_EN    FL_RMU_EnableLockUpReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_EnableLockUpReset(RMU_Type* RMUx)
{
    SET_BIT(RMUx->RSTCR, RMU_RSTCR_LKUPRST_EN_Msk);
}

/**
  * @brief    Soft Reset Chip
  * @rmtoll   SOFTRST        FL_RMU_SetSoftReset
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_SetSoftReset(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->SOFTRST, SOFTWARERESET_KEY);
}

/**
  * @brief    Get CLM2 Time Out Reset Flag
  * @rmtoll   RSTFR    CLM2_TOUT_FLAG    CLM2_TOUT
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM2_TOUT(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM2_TOUT_FLAG_Msk) == (RMU_RSTFR_CLM2_TOUT_FLAG_Msk));
}

/**
  * @brief    Get CLM2 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM2_UDF_FLAG    CLM2_UDF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM2_UDF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM2_UDF_FLAG_Msk) == (RMU_RSTFR_CLM2_UDF_FLAG_Msk));
}

/**
  * @brief    Get CLM2 Overflow Reset Flag
  * @rmtoll   RSTFR    CLM2_OVF_FLAG    CLM2_OVF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM2_OVF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM2_OVF_FLAG_Msk) == (RMU_RSTFR_CLM2_OVF_FLAG_Msk));
}

/**
  * @brief    Clear CLM2 Time Out   Reset Flag
  * @rmtoll   RSTFR    CLM2_TOUT_FLAG    CLM2_TOUT
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM2_TOUT(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM2_TOUT_FLAG_Msk);
}

/**
  * @brief    Clear CLM2 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM2_UDF_FLAG    CLM2_UDF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM2_UDF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM2_UDF_FLAG_Msk);
}

/**
  * @brief    Clear CLM2 Overflow  Reset Flag
  * @rmtoll   RSTFR    CLM2_OVF_FLAG    CLM2_OVF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM2_OVF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM2_OVF_FLAG_Msk);
}

/**
  * @brief    Get CLM1 Time Out Reset Flag
  * @rmtoll   RSTFR    CLM1_TOUT_FLAG    CLM1_TOUT
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM1_TOUT(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM1_TOUT_FLAG_Msk) == (RMU_RSTFR_CLM1_TOUT_FLAG_Msk));
}

/**
  * @brief    Get CLM1 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM1_UDF_FLAG    CLM1_UDF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM1_UDF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM1_UDF_FLAG_Msk) == (RMU_RSTFR_CLM1_UDF_FLAG_Msk));
}

/**
  * @brief    Get CLM1 Overflow Reset Flag
  * @rmtoll   RSTFR    CLM1_OVF_FLAG    CLM1_OVF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM1_OVF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM1_OVF_FLAG_Msk) == (RMU_RSTFR_CLM1_OVF_FLAG_Msk));
}

/**
  * @brief    Clear CLM1 Time Out   Reset Flag
  * @rmtoll   RSTFR    CLM1_TOUT_FLAG    CLM1_TOUT
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM1_TOUT(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM1_TOUT_FLAG_Msk);
}

/**
  * @brief    Clear CLM1 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM1_UDF_FLAG    CLM1_UDF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM1_UDF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM1_UDF_FLAG_Msk);
}

/**
  * @brief    Clear CLM1 Overflow  Reset Flag
  * @rmtoll   RSTFR    CLM1_OVF_FLAG    CLM1_OVF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM1_OVF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM1_OVF_FLAG_Msk);
}


/**
  * @brief    Get CLM0 Time Out Reset Flag
  * @rmtoll   RSTFR    CLM0_TOUT_FLAG    CLM0_TOUT
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM0_TOUT(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM0_TOUT_FLAG_Msk) == (RMU_RSTFR_CLM0_TOUT_FLAG_Msk));
}

/**
  * @brief    Get CLM0 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM0_UDF_FLAG    CLM0_UDF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM0_UDF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM0_UDF_FLAG_Msk) == (RMU_RSTFR_CLM0_UDF_FLAG_Msk));
}

/**
  * @brief    Get CLM0 Overflow Reset Flag
  * @rmtoll   RSTFR    CLM0_OVF_FLAG    CLM0_OVF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_CLM0_OVF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_CLM0_OVF_FLAG_Msk) == (RMU_RSTFR_CLM0_OVF_FLAG_Msk));
}

/**
  * @brief    Clear CLM0 Time Out   Reset Flag
  * @rmtoll   RSTFR    CLM0_TOUT_FLAG    CLM0_TOUT
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM0_TOUT(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM0_TOUT_FLAG_Msk);
}

/**
  * @brief    Clear CLM0 Underflow Reset Flag
  * @rmtoll   RSTFR    CLM0_UDF_FLAG    CLM0_UDF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM0_UDF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM0_UDF_FLAG_Msk);
}

/**
  * @brief    Clear CLM0 Overflow  Reset Flag
  * @rmtoll   RSTFR    CLM0_OVF_FLAG    CLM0_OVF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_CLM0_OVF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_CLM0_OVF_FLAG_Msk);
}

/**
  * @brief    Get TEST Reset Flag
  * @rmtoll   RSTFR    TEST_FLAG    FL_RMU_IsActiveFlag_TEST
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_TEST(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_TEST_FLAG_Msk) == (RMU_RSTFR_TEST_FLAG_Msk));
}

/**
  * @brief    Clear TEST Reset Flag
  * @rmtoll   RSTFR    TEST_FLAG    FL_RMU_ClearFlag_TEST
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_TEST(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_TEST_FLAG_Msk);
}

/**
  * @brief    Get RAMP Error Flag
  * @rmtoll   RSTFR    RAMP_FLAG    FL_RMU_IsActiveFlag_MAP
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_MAP(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_RAMP_FLAG_Msk) == (RMU_RSTFR_RAMP_FLAG_Msk));
}

/**
  * @brief    Clear RAMP Reset Flag
  * @rmtoll   RSTFR    RAMP_FLAG    FL_RMU_ClearFlag_MAP
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_MAP(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_RAMP_FLAG_Msk);
}

/**
  * @brief    Get MDF Reset Flag
  * @rmtoll   RSTFR    MDF_FLAG    FL_RMU_IsActiveFlag_MDF
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_MDF(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_MDF_FLAG_Msk) == (RMU_RSTFR_MDF_FLAG_Msk));
}

/**
  * @brief    Clear MDF Reset Flag
  * @rmtoll   RSTFR    MDF_FLAG    FL_RMU_ClearFlag_MDF
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_MDF(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_MDF_FLAG_Msk);
}

/**
  * @brief    Get NRST Reset Flag
  * @rmtoll   RSTFR    NRST_FLAG    FL_RMU_IsActiveFlag_NRST
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_NRST(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_NRST_FLAG_Msk) == (RMU_RSTFR_NRST_FLAG_Msk));
}

/**
  * @brief    Clear NRST Reset Flag
  * @rmtoll   RSTFR    NRST_FLAG    FL_RMU_ClearFlag_NRST
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_NRST(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_NRST_FLAG_Msk);
}

/**
  * @brief    Get Power On And Down Reset Flag
  * @rmtoll   RSTFR    PODR_FLAG    FL_RMU_IsActiveFlag_PODN
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_PODN(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_PODR_FLAG_Msk) == (RMU_RSTFR_PODR_FLAG_Msk));
}

/**
  * @brief    Clear  Power On And Down Reset Flag
  * @rmtoll   RSTFR    PODR_FLAG    FL_RMU_ClearFlag_PODN
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_PODN(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_PODR_FLAG_Msk);
}

/**
  * @brief    Get LOL Reset Flag
  * @rmtoll   RSTFR    LOL_FLAG    FL_RMU_IsActiveFlag_LOL
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_LOL(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_LOL_FLAG_Msk) == (RMU_RSTFR_LOL_FLAG_Msk));
}

/**
  * @brief    Clear LOL Reset Flag
  * @rmtoll   RSTFR    LOL_FLAG    FL_RMU_ClearFlag_LOL
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_LOL(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_LOL_FLAG_Msk);
}

/**
  * @brief    Get LOC Reset Flag
  * @rmtoll   RSTFR    LOC_FLAG    FL_RMU_IsActiveFlag_LOC
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_LOC(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_LOC_FLAG_Msk) == (RMU_RSTFR_LOC_FLAG_Msk));
}

/**
  * @brief    Clear LOC Reset Flag
  * @rmtoll   RSTFR    LOC_FLAG    FL_RMU_ClearFlag_LOC
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_LOC(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_LOC_FLAG_Msk);
}

/**
  * @brief    Get Software Reset Flag
  * @rmtoll   RSTFR    SOFT_FLAG    FL_RMU_IsActiveFlag_SOFT
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_SOFT(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_SOFT_FLAG_Msk) == (RMU_RSTFR_SOFT_FLAG_Msk));
}

/**
  * @brief    Clear Software Reset Flag
  * @rmtoll   RSTFR    SOFT_FLAG    FL_RMU_ClearFlag_SOFT
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_SOFT(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_SOFT_FLAG_Msk);
}

/**
  * @brief    Get IWDT Reset Flag
  * @rmtoll   RSTFR    IWDT_FLAG    FL_RMU_IsActiveFlag_IWDT
  * @param    RMUx RMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RMU_IsActiveFlag_IWDT(RMU_Type* RMUx)
{
    return (uint32_t)(READ_BIT(RMUx->RSTFR, RMU_RSTFR_IWDT_FLAG_Msk) == (RMU_RSTFR_IWDT_FLAG_Msk));
}

/**
  * @brief    Clear IWDT Reset Flag
  * @rmtoll   RSTFR    IWDT_FLAG    FL_RMU_ClearFlag_IWDT
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_IWDT(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_IWDT_FLAG_Msk);
}

/**
  * @brief    Clear SVD Reset Flag
  * @rmtoll   RSTFR    SVD_FLAG    FL_RMU_ClearFlag_SVD
  * @param    RMUx RMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_RMU_ClearFlag_SVD(RMU_Type* RMUx)
{
    WRITE_REG(RMUx->RSTFR, RMU_RSTFR_SVD_FLAG_Msk);
}

